"""
    复习-函数参数
    形式参数：限制实参提供数据的方式
        位置形参:实参必填
            def 函数名(名称1,名称2):
        默认形参：实参可选
            def 函数名(名称1=数据,名称2=数据):
        星号元组形参：多位置实参合一元组
            def 函数名(*args)
        双星号字典形参：多关键字实参合一字典
            def 函数名(**kwargs)
        命名关键字形参：实参必须是关键字实参
            def 函数名(*args,名称)
            def 函数名(*,名称)

    实际参数：与形参如何对应
        位置实参：按顺序
                函数名(数据1,数据2)
            序列实参：一序列拆多元素
                函数名(*序列)
        关键字实参：按名称
                函数名(名称1=数据,名称2=数据)
            字典实参：一字典拆多元素
                函数名(**字典)

"""


# 默认形参：实参可以不给哦
def func01(a=1, b=2):
    pass

# 命名关键字形参：实参必须是关键字实参
def func02(*, a):
    pass


func01()
func01(2)
# 关键字实参：根据名称对应(要跳过形参a)
func01(b=20)

func02(a = 10)