"""
    答疑
    1. 函数参数星号作用？
    2. 列表元素读取和修改的区别？

"""


# 位置形参p1:实参必须提供
# 星号元组形参args:多个实参合并为元组
def func01(p1, *args): # [合]
    print(p1)  # 10
    print(args)  # (20, 30, 40)

def func02(p1,p2,p3):
    print(p1)
    print(p2)
    print(p3)

func01(10, 20, 30, 40)
list01 = [10,20,30]
# func02(list01)# 传递的是一个列表
func02(*list01) # [拆]传递列表的元素

# 修改列表元素:定位代码在赋值号左边
# list01[0] = ?
# 读取列表元素:定位代码在赋值号右边
# ? = list01[0]
# 切片读取元素,会触发浅拷贝
# ?=list01[:]
# in的本质会遍历右侧切片数据,所以也会触发浅拷贝
print(10 in list01[:3])
# 删除列表多个元素,不是读取数据,不会触发浅拷贝
del  list01[:3]
