"""
    数据类型 - 字面值
        整形int   浮点型float  字符串str    布尔bool
          10       10.1         "10"   True    False
                                      2 > 1  "男"=="女"
"""
# 1. 整形字面值
# --十进制DEC:每位用十种状态计数，逢十进一，写法是0~9
number01 = 10
# --二进制BIN:每位用二种状态计数，逢二进一，写法是0~1
# 0 1 10 11 100 101 ...
number02 = 0b10
print(number02)
# --八进制OCT:每位用八种状态计数，逢八进一，写法是0~7
# 0 1 ... 7 10 11 ... 17 20
number03 = 0o10
print(number03)
# --十六进制HEX:每位用十六种状态计数，逢十六进一，写法是0~9 a(10)~f(15)
# 0 ~ 9  a~f 10  11
number04 = 0x10
print(number04)

# 2. 浮点型字面值
# -- 小数
number01 = 1.23
# -- 科学计数法
number02 = 0.00001
print(number02)  # 1e-05
print(1e-05 == 0.00001)
