"""
    数据基本运算
        数据
            变量:操作数据
            类型:int  float  bool  str
                10    1.2
        运算
            主要用于数值间:
                算数:+ - * ** / // %
                增强:+= -= *= **= /= //= %=
                比较:== != > < >= <=
            主要用于条件间:
            逻辑:and  or  not

    语句-流程控制
        选择语句:让代码根据条件执行
            if 条件:
                满足条件执行的代码
            else:
                不满足条件执行的代码
        循环语句:让代码重复执行
            --根据条件重复
                while 条件:
                    循环体
            --根据次数重复
                for ... range(开始,结束,间隔):
        跳转语句:在循环中让代码不执行
            break 跳出(跳过后续代码后,不再执行循环)
            continue 跳过(跳过后续代码后,继续执行循环)
"""