"""
    切片
        定位多个元素
       　
"""
msg = "花果山齐天大圣孙悟空"
# 语法1:容器名[开始:结束:间隔]
# 注意：不包含结束
print(msg[0:3:1])
# 语法2:容器名[开始:结束]
# 注意：间隔默认为1
print(msg[0:3])
# 语法3:容器名[:结束]
# 注意：开始默认为开头
print(msg[:3])
# 语法4:容器名[:]
# 注意：结束默认为末尾
print(msg[:])

msg = "花果山齐天大圣孙悟空"
# 齐天大圣
print(msg[3:7])
print(msg[3:-3])
# 孙悟空
print(msg[-3:])
# 前两个字.后两个字
print(msg[:2])
print(msg[-2:])
# 空
print(msg[1:1])
print(msg[2:0])
print(msg[-1:1])
print(msg[-1:1:-1])# 空悟孙圣大天齐山
print(msg[2:0:-1]) #山果
print(msg[:100]) # 切片越界不会报错
# 特殊
print(msg[::-1]) # 空悟孙圣大天齐山果花

